src/InformationRegisters/НастройкиОтправкиЭлектронныхДокументовПоВидам/НастройкиОтправкиЭлектронныхДокументовПоВидам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОтправкиЭлектронныхДокументовПоВидам</name>
  <resources>
    <name>ВерсияФормата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбменаЭД</name>
    <type>
      <types>EnumRef.СпособыОбменаЭД</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаршрутПодписания</name>
    <type>
      <types>CatalogRef.МаршрутыПодписания</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяОтветнаяПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяИзвещениеОПолучении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Формировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияФорматаУстановленаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнениеКодаТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресОтправителя</name>
    <comment>Адрес отправителя документов при прямом обмене</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АдресПолучателя</name>
    <comment>Адрес получателя документов при прямом обмене</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбменБезПодписи</name>
    <comment>Признак использования подписи при прямом обмене</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.УчастникЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>DefinedType.ДоговорСКонтрагентомЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьВидДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументовЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПрикладнойВидЭД</name>
    <type>
      <types>DefinedType.ПрикладныеТипыЭлектронныхДокументовЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиОтправкиЭлектронныхДокументов/НастройкиОтправкиЭлектронныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОтправкиЭлектронныхДокументов</name>
  <resources>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьУПД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьУКД</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоИнтеркампани</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоПрямойОбмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.УчастникЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>DefinedType.ДоговорСКонтрагентомЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиОтправкиЭлектронныхДокументовПоВидам/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль набора записей регистра сведений НастройкиОтправкиЭлектронныхДокументовПоВидам
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ПустойДоговор = ОбменСКонтрагентамиИнтеграция.ВсеПустыеЗначенияДоговораСКонтрагентомЭДО();
	Запрос.УстановитьПараметр("ПустойДоговор", ПустойДоговор);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиОтправкиЭлектронныхДокументовПоВидам.Отправитель КАК Отправитель,
		|	НастройкиОтправкиЭлектронныхДокументовПоВидам.Получатель КАК Получатель,
		|	НастройкиОтправкиЭлектронныхДокументовПоВидам.Договор КАК Договор,
		|	НастройкиОтправкиЭлектронныхДокументовПоВидам.СпособОбменаЭД = ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.Внутренний) КАК ЭтоИнтеркампани
		|ПОМЕСТИТЬ КлючевыеРеквизиты
		|ИЗ
		|	РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам КАК НастройкиОтправкиЭлектронныхДокументовПоВидам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючевыеРеквизиты.Отправитель КАК Отправитель,
		|	КлючевыеРеквизиты.Получатель КАК Получатель,
		|	КлючевыеРеквизиты.Договор КАК Договор,
		|	ИСТИНА КАК Добавить,
		|	КлючевыеРеквизиты.ЭтоИнтеркампани КАК ЭтоИнтеркампани
		|ИЗ
		|	КлючевыеРеквизиты КАК КлючевыеРеквизиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиОтправкиЭлектронныхДокументов КАК НастройкиОтправкиЭлектронныхДокументов
		|		ПО КлючевыеРеквизиты.Отправитель = НастройкиОтправкиЭлектронныхДокументов.Отправитель
		|			И КлючевыеРеквизиты.Получатель = НастройкиОтправкиЭлектронныхДокументов.Получатель
		|			И КлючевыеРеквизиты.Договор = НастройкиОтправкиЭлектронныхДокументов.Договор
		|ГДЕ
		|	НастройкиОтправкиЭлектронныхДокументов.Отправитель ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КлючевыеРеквизиты.Отправитель,
		|	КлючевыеРеквизиты.Получатель,
		|	КлючевыеРеквизиты.Договор,
		|	ИСТИНА,
		|	КлючевыеРеквизиты.ЭтоИнтеркампани
		|ИЗ
		|	КлючевыеРеквизиты КАК КлючевыеРеквизиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиОтправкиЭлектронныхДокументов КАК НастройкиОтправкиЭлектронныхДокументов
		|		ПО КлючевыеРеквизиты.Отправитель = НастройкиОтправкиЭлектронныхДокументов.Отправитель
		|			И КлючевыеРеквизиты.Получатель = НастройкиОтправкиЭлектронныхДокументов.Получатель
		|			И НастройкиОтправкиЭлектронныхДокументов.Договор В (&ПустойДоговор)
		|ГДЕ
		|	КлючевыеРеквизиты.Договор В (&ПустойДоговор)
		|	И НастройкиОтправкиЭлектронныхДокументов.Отправитель ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиОтправкиЭлектронныхДокументов.Отправитель,
		|	НастройкиОтправкиЭлектронныхДокументов.Получатель,
		|	НастройкиОтправкиЭлектронныхДокументов.Договор,
		|	ЛОЖЬ,
		|	КлючевыеРеквизиты.ЭтоИнтеркампани
		|ИЗ
		|	РегистрСведений.НастройкиОтправкиЭлектронныхДокументов КАК НастройкиОтправкиЭлектронныхДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ КлючевыеРеквизиты КАК КлючевыеРеквизиты
		|		ПО КлючевыеРеквизиты.Отправитель = НастройкиОтправкиЭлектронныхДокументов.Отправитель
		|			И КлючевыеРеквизиты.Получатель = НастройкиОтправкиЭлектронныхДокументов.Получатель
		|			И КлючевыеРеквизиты.Договор = НастройкиОтправкиЭлектронныхДокументов.Договор
		|ГДЕ
		|	КлючевыеРеквизиты.Отправитель ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиОтправкиЭлектронныхДокументов.Отправитель,
		|	НастройкиОтправкиЭлектронныхДокументов.Получатель,
		|	НастройкиОтправкиЭлектронныхДокументов.Договор,
		|	ЛОЖЬ,
		|	КлючевыеРеквизиты.ЭтоИнтеркампани
		|ИЗ
		|	РегистрСведений.НастройкиОтправкиЭлектронныхДокументов КАК НастройкиОтправкиЭлектронныхДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ КлючевыеРеквизиты КАК КлючевыеРеквизиты
		|		ПО КлючевыеРеквизиты.Отправитель = НастройкиОтправкиЭлектронныхДокументов.Отправитель
		|			И КлючевыеРеквизиты.Получатель = НастройкиОтправкиЭлектронныхДокументов.Получатель
		|			И КлючевыеРеквизиты.Договор В (&ПустойДоговор)
		|ГДЕ
		|	НастройкиОтправкиЭлектронныхДокументов.Договор В (&ПустойДоговор)
		|	И КлючевыеРеквизиты.Отправитель ЕСТЬ NULL";
	
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Начало = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("РегистрСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам.МодульНабораЗаписей.ПриЗаписи");
		
		ЗаписьЗапроса = РезультатЗапроса.Выбрать();
		Счетчик = 0;
		
		НачатьТранзакцию();
		Попытка
			
			Пока ЗаписьЗапроса.Следующий() Цикл
				
				Счетчик = Счетчик + 1;
				МенеджерЗаписи = РегистрыСведений.НастройкиОтправкиЭлектронныхДокументов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЗаписьЗапроса);
				
				Если ЗаписьЗапроса.Добавить Тогда
					МенеджерЗаписи.ДатаНачалаДействия = ТекущаяДатаСеанса();
					МенеджерЗаписи.Записать();
				Иначе
					МенеджерЗаписи.Удалить();
				КонецЕсли;
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			Информация = ИнформацияОбОшибке();
			
			ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Обновление настроек отправки';
															|en = 'Update dispatch settings'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация),
				НСтр("ru = 'Не удалось обновить настройки отправки электронных документов';
					|en = 'Cannot update electronic document dispatch settings'"));
			
		КонецПопытки;
		
		УстановитьПривилегированныйРежим(Ложь);
		
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Начало, Счетчик);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияБЭД.НормализоватьПустыеЗначенияСоставныхИзмеренийНабораЗаписей(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти


#КонецЕсли
